import Mock from 'mockjs'

Mock.setup({
  timeout: 500
})
// table请求
Mock.mock('/API/querytable.py', 'post', Options => {
    return {
        "data":[
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
            {
                "项目名称": "南非红酒市场需求调研",
                "项目类型": "分类一",
                "国家/地区": "北京市",
                "状态": "显示",
                "发布人": "admin",
                "发布时间": "2019-10-11"
            },
        ]
    }
})
//类型
Mock.mock('/API/type.py', 'post', Options => {
    return {
        "data": "房地产,制造业,采矿业,金融业"
    }
})
// 地区
Mock.mock('/API/area.py', 'post', Options => {
    return {
        "data": "北京,上海,天津,重庆"
    }
})
export default Mock


